grevaillot/svd_tools/headers/STM32F446/memorymap.h
#pragma once 

#define TIM2_BASE			(0x40000000)
#define TIM3_BASE			(0x40000400)
#define TIM4_BASE			(0x40000800)
#define TIM5_BASE			(0x40000c00)
#define TIM6_BASE			(0x40001000)
#define TIM7_BASE			(0x40001400)
#define TIM12_BASE			(0x40001800)
#define TIM13_BASE			(0x40001c00)
#define TIM14_BASE			(0x40002000)
#define RTC_BASE			(0x40002800)
#define WWDG_BASE			(0x40002c00)
#define IWDG_BASE			(0x40003000)
#define SPI2_BASE			(0x40003800)
#define SPI3_BASE			(0x40003c00)
#define SPDIF_RX_BASE			(0x40004000)
#define USART2_BASE			(0x40004400)
#define USART3_BASE			(0x40004800)
#define UART4_BASE			(0x40004c00)
#define UART5_BASE			(0x40005000)
#define I2C1_BASE			(0x40005400)
#define I2C2_BASE			(0x40005800)
#define I2C3_BASE			(0x40005c00)
#define CAN1_BASE			(0x40006400)
#define CAN2_BASE			(0x40006800)
#define HDMI_CEC_BASE			(0x40006c00)
#define PWR_BASE			(0x40007000)
#define DAC_BASE			(0x40007400)
#define TIM1_BASE			(0x40010000)
#define TIM8_BASE			(0x40010400)
#define USART1_BASE			(0x40011000)
#define USART6_BASE			(0x40011400)
#define ADC1_BASE			(0x40012000)
#define ADC2_BASE			(0x40012100)
#define ADC3_BASE			(0x40012200)
#define C_ADC_BASE			(0x40012300)
#define SDMMC_BASE			(0x40012c00)
#define SPI1_BASE			(0x40013000)
#define SPI4_BASE			(0x40013400)
#define SYSCFG_BASE			(0x40013800)
#define EXTI_BASE			(0x40013c00)
#define TIM9_BASE			(0x40014000)
#define TIM10_BASE			(0x40014400)
#define TIM11_BASE			(0x40014800)
#define SAI1_BASE			(0x40015800)
#define SAI2_BASE			(0x40015c00)
#define GPIOA_BASE			(0x40020000)
#define GPIOB_BASE			(0x40020400)
#define GPIOC_BASE			(0x40020800)
#define GPIOD_BASE			(0x40020c00)
#define GPIOE_BASE			(0x40021000)
#define GPIOF_BASE			(0x40021400)
#define GPIOG_BASE			(0x40021800)
#define GPIOH_BASE			(0x40021c00)
#define CRC_BASE			(0x40023000)
#define RCC_BASE			(0x40023800)
#define FLASH_BASE			(0x40023c00)
#define DMA1_BASE			(0x40026000)
#define DMA2_BASE			(0x40026400)
#define OTG_HS_GLOBAL_BASE			(0x40040000)
#define OTG_HS_HOST_BASE			(0x40040400)
#define OTG_HS_DEVICE_BASE			(0x40040800)
#define OTG_HS_PWRCLK_BASE			(0x40040e00)
#define OTG_FS_GLOBAL_BASE			(0x50000000)
#define OTG_FS_HOST_BASE			(0x50000400)
#define OTG_FS_DEVICE_BASE			(0x50000800)
#define OTG_FS_PWRCLK_BASE			(0x50000e00)
#define DCMI_BASE			(0x50050000)
#define FMC_BASE			(0xa0000000)
#define QUADSPI_BASE			(0xa0001000)
#define SCB_ACTRL_BASE			(0xe000e008)
#define STK_BASE			(0xe000e010)
#define NVIC_BASE			(0xe000e100)
#define SCB_BASE			(0xe000ed00)
#define FPU_CPACR_BASE			(0xe000ed88)
#define MPU_BASE			(0xe000ed90)
#define NVIC_STIR_BASE			(0xe000ef00)
#define FPU_BASE			(0xe000ef34)
#define DBG_BASE			(0xe0042000)
